# CannotKeepTrussJoined Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..JoinElementsFailures..::..CannotKeepTrussJoined Property
BuiltInFailures..::..JoinElementsFailures Class See Also
---
Can't keep the highlighted [Element]s joined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotKeepTrussJoined { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotKeepTrussJoined As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotKeepTrussJoined {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..JoinElementsFailures Class
Autodesk.Revit.DB Namespace